In [1]:
import pandas as pd

##### Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Actions/Prescription

#### Problems Encountered
1. Columns name are not given - names operator is used
2. File is tab seperated - sep operator is used

In [2]:
#Column Names
cols = ['user_id', 'movie_id', 'rating', 'ts']

In [3]:
#Reading File1
df = pd.read_csv('u.data', sep = '\t', names = cols)

In [4]:
a = [4,8,2,7,9]

In [5]:
b = []
for i in a:
    b.append(i*2)
b

[8, 16, 4, 14, 18]

In [6]:
b = [i*2 for i in a]
b

[8, 16, 4, 14, 18]

In [7]:
item_cols = ['movie_id', 'title'] + [str(i) for i in range(22)]

In [8]:
#Reading File2
df1 = pd.read_csv('u.item', sep = '|', names = item_cols, encoding = "ISO-8859-1")[['movie_id', 'title']]

In [9]:
df1.shape

(1682, 2)

#### Exploratory Data Analysis (EDA)

In [10]:
df1.sample(5)

      movie_id                         title
324        325                  Crash (1996)
1026      1027           Shooter, The (1995)
104        105             Sgt. Bilko (1996)
1373      1374  Falling in Love Again (1980)
301        302      L.A. Confidential (1997)

In [11]:
#Sample Data
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [12]:
#Sample Data
df.sample(5)

       user_id  movie_id  rating         ts
3725       215        22       3  891435161
11350      368       219       2  889783453
57806       53       156       4  879442561
82781      535      1063       4  879618613
30172       28       449       2  881961394

In [13]:
#Tells the structure of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [14]:
#Gives the statistics of the given data
#or
#Describes the data
df.describe(include = 'all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

#### Segregating the Data
1. Strings with categorical Info
2. Strings with Random Stuff
3. Numbers with Quantified Info
4. Numbers with Categorical Info
5. Random Numbers or ID Sort of data

In [15]:
#Unique Ratings
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [16]:
#Checking the number of unique users
df['user_id'].nunique()

944

In [17]:
#Checking the Number of unique movies
df['movie_id'].nunique()

1682

In [18]:
#Merging the Data Frames

In [19]:
movie = pd.merge(df, df1, on = 'movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [20]:
#Remove the redundant or useless columns i.e. ts
movie.drop('ts', axis = 1, inplace = True)

In [21]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [22]:
#Finding the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [23]:
#Finding the average rating for each movi
movie.groupby('title')['rating'].mean().sort_values(ascending = False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [24]:
#Converting Pandas Series to DataFrame
ratings = pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending = False))

In [25]:
#Adding a new column named rating in the exisiting DataFrame
ratings['count'] = movie['title'].value_counts()

In [26]:
ratings.head(10)

                                                   rating  count
title
They Made Me a Criminal (1939)                        5.0      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1
Saint of Fort Washington, The (1993)                  5.0      2
Someone Else's America (1995)                         5.0      1
Star Kid (1997)                                       5.0      3
Great Day in Harlem, A (1994)                         5.0      1
Aiqing wansui (1994)                                  5.0      1
Santa with Muscles (1996)                             5.0      2
Prefontaine (1997)                                    5.0      3
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1

In [27]:
#Sorting the values in DataFrame by value counts
ratings.sort_values(by = 'count', ascending=False).head(10)

                                 rating  count
title
Star Wars (1977)               4.359589    584
Contact (1997)                 3.803536    509
Fargo (1996)                   4.155512    508
Return of the Jedi (1983)      4.007890    507
Liar Liar (1997)               3.156701    485
English Patient, The (1996)    3.656965    481
Scream (1996)                  3.441423    478
Toy Story (1995)               3.878319    452
Air Force One (1997)           3.631090    431
Independence Day (ID4) (1996)  3.438228    429

In [28]:
movie_pivot = movie.pivot_table(index = 'user_id', columns = 'title', values = 'rating')
movie_pivot.head(5)

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
movie_selected = 'Star Wars (1977)'

In [30]:
ms_rates = movie_pivot[movie_selected]
ms_rates.head(5)

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [31]:
#Removing the warnings from the entire code
import warnings
warnings.filterwarnings('ignore')

In [32]:
#Finding correlation of selected movie with all the movies in the DataFrame
corrs = movie_pivot.corrwith(ms_rates)
corrs.head(15)

title
'Til There Was You (1997)                      0.872872
1-900 (1994)                                  -0.645497
101 Dalmatians (1996)                          0.211132
12 Angry Men (1957)                            0.184289
187 (1997)                                     0.027398
2 Days in the Valley (1996)                    0.066654
20,000 Leagues Under the Sea (1954)            0.289768
2001: A Space Odyssey (1968)                   0.230884
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                           0.106453
8 1/2 (1963)                                  -0.142977
8 Heads in a Duffel Bag (1997)                -0.577350
8 Seconds (1994)                              -0.755929
A Chef in Love (1996)                          0.868599
Above the Rim (1994)                          -0.645497
dtype: float64

In [33]:
#Sorting the correlated values
corrs.sort_values(ascending=False).head(20)

title
Hollow Reed (1996)                                                                   1.0
Stripes (1981)                                                                       1.0
Star Wars (1977)                                                                     1.0
Man of the Year (1995)                                                               1.0
Beans of Egypt, Maine, The (1994)                                                    1.0
Safe Passage (1994)                                                                  1.0
Old Lady Who Walked in the Sea, The (Vieille qui marchait dans la mer, La) (1991)    1.0
Outlaw, The (1943)                                                                   1.0
Line King: Al Hirschfeld, The (1996)                                                 1.0
Hurricane Streets (1998)                                                             1.0
Good Man in Africa, A (1994)                                                         1.0
Scarlet Letter, The (1926)                                                           1.0
Golden Earrings (1947)                                                               1.0
Full Speed (1996)                                                                    1.0
Twisted (1996)                                                                       1.0
Ed's Next Move (1996)                                                                1.0
Mondo (1996)                                                                         1.0
Cosi (1996)                                                                          1.0
Commandments (1997)                                                                  1.0
No Escape (1994)                                                                     1.0
dtype: float64

In [34]:
corrs_df = pd.DataFrame(corrs, columns = ['Correlation'])
corrs_df.head(10)

                                             Correlation
title
'Til There Was You (1997)                       0.872872
1-900 (1994)                                   -0.645497
101 Dalmatians (1996)                           0.211132
12 Angry Men (1957)                             0.184289
187 (1997)                                      0.027398
2 Days in the Valley (1996)                     0.066654
20,000 Leagues Under the Sea (1954)             0.289768
2001: A Space Odyssey (1968)                    0.230884
3 Ninjas: High Noon At Mega Mountain (1998)          NaN
39 Steps, The (1935)                            0.106453

In [35]:
corrs_df['avg_rating'] = ratings['rating']
corrs_df['count'] = ratings['count']
corrs_df.head(10)

                                             Correlation  avg_rating  count
title
'Til There Was You (1997)                       0.872872    2.333333      9
1-900 (1994)                                   -0.645497    2.600000      5
101 Dalmatians (1996)                           0.211132    2.908257    109
12 Angry Men (1957)                             0.184289    4.344000    125
187 (1997)                                      0.027398    3.024390     41
2 Days in the Valley (1996)                     0.066654    3.225806     93
20,000 Leagues Under the Sea (1954)             0.289768    3.500000     72
2001: A Space Odyssey (1968)                    0.230884    3.969112    259
3 Ninjas: High Noon At Mega Mountain (1998)          NaN    1.000000      5
39 Steps, The (1935)                            0.106453    4.050847     59

In [36]:
#Only considering the movies which have more than 50 ratings and rearranging themj in descending order 
corrs_df[corrs_df['count']>50].sort_values(by = 'Correlation', ascending = False).head(10)

,Correlation,avg_rating,count
title,,,
Star Wars (1977),1.000000,4.359589,584
"Empire Strikes Back, The (1980)",0.748353,4.206522,368
Return of the Jedi (1983),0.672556,4.007890,507
Raiders of the Lost Ark (1981),0.536117,4.252381,420
Giant (1956),0.488093,3.745098,51
"Life Less Ordinary, A (1997)",0.411638,3.075472,53
Austin Powers: International Man of Mystery (1997),0.377433,3.246154,130
"Sting, The (1973)",0.367538,4.058091,241
Indiana Jones and the Last Crusade (1989),0.350107,3.930514,331
Pinocchio (1940),0.347868,3.673267,101

In [37]:
#Selecting the top 3 recommendations from the given table includig the selected movie
top_recom = list(corrs_df[corrs_df['count']>50].sort_values(by = 'Correlation', ascending = False).head(3).index)

In [38]:
top_recom

['Star Wars (1977)',
 'Empire Strikes Back, The (1980)',
 'Return of the Jedi (1983)']

In [39]:
#Removing the selected movie from all three recommended movies
top_recom.remove(movie_selected)

In [40]:
top_recom

['Empire Strikes Back, The (1980)', 'Return of the Jedi (1983)']